---
kind: method
id: M:Autodesk.Revit.DB.ExportLinetypeInfo.#ctor(Autodesk.Revit.DB.ExportLinetypeInfo)
source: html/2c8ce5bc-4419-63c7-6c96-b5b55aadfd01.htm
---
# Autodesk.Revit.DB.ExportLinetypeInfo.#ctor Method

Constructs a new copy of the input ExportLinetypeInfo object.

## Syntax (C#)
```csharp
public ExportLinetypeInfo(
	ExportLinetypeInfo other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.ExportLinetypeInfo`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null